Revit 2025 API
BrowserOrganizationType Enumeration
 Enumerated type representing the type of browser organization.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum BrowserOrganizationType
Public Enumeration BrowserOrganizationType
public enum class BrowserOrganizationType
type BrowserOrganizationType
Members
Member name | Value | Description
Views | 0 |  The browser organization definition for views.
Sheets | 1 |  The browser organization definition for sheets.
Schedules | 3 |  The browser organization definition for schedules.
See Also
Reference
Autodesk.Revit.DB Namespace